studyBFR/combustionAxi/constant/pointPriority
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       labelList;
    location    "1";
    object      pointPriority;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

53763{-2147483648}

// ************************************************************************* //
