studyBFR/combustionAxi/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
26600
(
(9.87237 5.23031 -11.798)
(9.41771 5.27164 -11.4491)
(9.41528 5.30697 -11.1537)
(9.51293 5.32973 -10.8878)
(9.69379 5.34958 -10.6217)
(9.94623 5.40463 -10.3704)
(10.2236 5.49317 -10.1146)
(10.5098 5.59429 -9.8553)
...
)
;

boundaryField
{
    inlet
    {
        type            groovyBC;
        refValue        nonuniform List<vector> 
40
(
(10 4.5 -12)
(10 4.5 -12)
(10 4.5 -12)
(10 4.5 -12)
(10 4.5 -12)
(10 4.5 -12)
(10 4.5 -12)
(10 4.5 -12)
...
)
;
        refGradient     uniform (0 0 0);
        valueFraction   uniform 1;
        value           nonuniform List<vector> 
40
(
(10 4.5 -12)
(10 4.5 -12)
(10 4.5 -12)
(10 4.5 -12)
(10 4.5 -12)
(10 4.5 -12)
(10 4.5 -12)
(10 4.5 -12)
...
)
;
        valueExpression "vector(u,v,w)";
        gradientExpression "vector(0,0,0)";
        fractionExpression "1";
        evaluateDuringConstruction 0;
        variables       
13
(
"cFactor=1;"
"distSquare=pos().y*pos().y+pos().z*pos().z;"
"distR=pow(distSquare,0.5);"
"costh=pos().z/distR;"
"sinth=pos().y/distR;"
"radial=(distR >= 0.025) ? 4.5 : 0;"
"tang=(distR >= 0.025) ? 12 : 0;"
"u1=(distR<0.015) ? 2.053 : 0;"
"u2=(distR >= 0.015 && distR < 0.025) ? 4.827 : 0;"
"u3=(distR >= 0.025) ? 10 : 0;"
"u=cFactor*(u1+u2+u3);"
"v=cFactor*(tang*costh+radial*sinth);"
"w=cFactor*(radial*costh-tang*sinth);"
)
;
        timelines       (
);
        lookuptables    (
);
    }
    outlet
    {
        type            zeroGradient;
    }
    fixedWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    bottom
    {
        type            empty;
    }
    frontAndBack_pos
    {
        type            wedge;
    }
    frontAndBack_neg
    {
        type            wedge;
    }
}


// ************************************************************************* //
