studyBFR/combustionAxi/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.234;

boundaryField
{
    /*
    inlet
    {
        type            fixedValue;
        value           uniform 0.0551;
    }*/

    inlet
    {
        type            groovyBC;
        variables (
            "cFactor=1;"
            "distSquare=pos().y*pos().y+pos().z*pos().z;"
            "distR=pow(distSquare,0.5);"	
            "mf1=(distR<0.015) ? 0 : 0;"
            "mf2=(distR >= 0.015 && distR < 0.025) ? 0 : 0;"
            "mf3=(distR >= 0.025) ? 0.234 : 0;"
            "mfNet=cFactor*(mf1+mf2+mf3);"
        );
        value uniform 0.234;
        valueExpression "mfNet";
    }

    outlet
    {
        type            zeroGradient;
    }
    fixedWalls
    {
        type            zeroGradient;
    }
    frontAndBack_pos
    {
        type            wedge;
    } 
    
    frontAndBack_neg
    {
        type            wedge;
    }
    
    bottom
    {
        type            empty;
    }
    
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
